driver-tests/bpelse/assign/CopyByValue/CopyByValueJbi/test/bug508/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dyn="http://j2ee.netbeans.org/wsdl/DynamicContent1Way">
  <soapenv:Body>
    <dyn:DynamicContent1WayOperation>
      <input>Testing bug 508</input>
    </dyn:DynamicContent1WayOperation>
  </soapenv:Body>
</soapenv:Envelope>